
import random

def game():
    arr = [['Александр Сергеевич Пушкин', '06.06.1799'],
          ['Николай Васильевич Гоголь',  '01.04.1809'],
          ['Сергей Александрович Есенин', '03.10.1895'],
          ['Лев Николаевич Толстой',  '09.09.1828'],
          ['Михаи́л Ю́рьевич Ле́рмонтов',  '15.10.1814'],
           ['Евгений Иванович ЗАМЯТИН','01.02.1884'],
           ['Анна Андреевна АХМАТОВА','23.06.1889'],
           ['Аркадий Натанович СТРУГАЦКИЙ','28.08.1925'],
           ['Иосиф Александрович БРОДСКИЙ','24.05.1940'],
           ['Василий Павлович АКСЕНОВ','20.08.1932']]
    arrFinal =  random.sample(arr, 5)
    answer = 'Да'

    while answer == 'Да':
        count = 0
        for i in arrFinal:

            answer = input(f'Когда родился {i[0]}(формат dd.mm.yyyy))?\n')

            if answer == i[1]:
                print("Верно!")
                count+=1
        print(f"Вы набрали: {count} правильных ответов \n {len(arrFinal)- count} неправильных ответов,"
              f" \n {count/len(arrFinal)*100} Процент правильных ответов \n {(len(arrFinal)- count)/len(arrFinal)*100} Процент неправильных ответов")
        answer = input(f'Продолжим играть? (Да / любое другое значение)')




